[
  {
    "id": 101,
    "title": "Senior Executive Assistant",
    "department": "Administration",
    "type": "Full-time / Permanent position",
    "location": "Longueuil - South Shore",
    "summary": "Seeking a senior executive assistant to provide strategic and operational support to senior management.",
    "description": "<p>Reporting to the Executive Vice President, the senior assistant acts as strategic and operational support to senior management. He or she ensures effective coordination of priorities, facilitates the flow of information, prepares key documents and actively participates in the management of cross-functional projects.\n      \n      Main Responsibilities\n      \n        Assist the vice-presidency and general management in planning, monitoring and coordinating activities\n        Coordinate exchanges with team members, partners, decision-making bodies and stakeholders\n        Participate in the preparation of documents for grant applications and account reports\n        Participate in the preparation of management meetings, board meetings and committees, and ensure associated logistics\n        Manage agenda, organize internal and external meetings, prepare agendas, minutes and follow-ups\n        Write, revise and format documents, presentations, reports, letters and official communications\n        Support the deployment and monitoring of special or strategic projects\n      \n      \n      Desired Profile\n      \n        University or college degree in administration, management, communications or related field\n        Minimum 5 to 7 years of relevant experience in a similar position, ideally in a complex or multi-project environment\n        Excellent written and oral communication skills in French and English\n        Strong organizational skills, rigor, discretion and ability to manage multiple priorities\n        Mastery of office tools (Google Suite, Microsoft 365, PowerPoint, Canva)\n        Initiative, autonomy, diplomacy and ability to work under pressure\n      \n      \n      Working Conditions\n      \n        Competitive salary based on experience\n        Full-time position (37.5 hours/week)\n        Hybrid work mode with office presence required 4 to 5 days/week\n        Dynamic, stimulating and collaborative environment\n        Group insurance and RRSP + employer contribution offered after probation period</p>",
    "salary": "Competitive based on experience",
    "startDate": "As soon as possible",
    "emailSubject": "Application - Senior Executive Assistant",
    "applyEmail": "rh@gpcqm.ca",
    "deadline": "July 28, 2025",
    "datePosted": "2025-07-22"
  },
  {
    "id": 102,
    "title": "Event Coordinator - DOCK619",
    "department": "Events",
    "type": "Permanent",
    "location": "Longueuil, QC",
    "summary": "Support the team in organizing, logistics and execution of events at DOCK619.",
    "description": "\n      <p>DOCK619 is a multifunctional event space located in Longueuil's industrial district. The interaction between its industrial architecture and warm design creates a unique atmosphere. DOCK619 offers the chance to welcome guests in a uniquely designed space thanks to its modern style, state-of-the-art technology, and exceptional market cuisine.</p>\n      \n      <h3>Your Mission</h3>\n      <p>Support the team in organizing, logistics and execution of events, as well as in deploying internal and external communications, participate in promoting the event venue to a target audience and ensure the smooth running of ongoing events.</p>\n      \n      <h3>Your Responsibilities</h3>\n      <ul>\n        <li>Manage DOCK619's social media and website updates</li>\n        <li>Plan and coordinate logistical aspects of events (timelines, schedules and scenarios, menu choices, etc.)</li>\n        <li>Establish server schedules and create mini-training sessions to improve their knowledge of the menu and service techniques</li>\n        <li>Participate in hiring new servers</li>\n        <li>Perform various clerical tasks such as maintaining the event calendar and participating in inventory counts</li>\n      </ul>\n      \n      <h3>Required Profile</h3>\n      <ul>\n        <li>College diploma in event management, communications, marketing or related field</li>\n        <li>Minimum 2 years of experience in event coordination</li>\n        <li>Excellent communication and interpersonal skills</li>\n        <li>Ability to manage multiple projects simultaneously</li>\n        <li>Knowledge of social media and digital marketing</li>\n        <li>Bilingualism (French and English) required</li>\n      </ul>\n      \n      <h3>We Offer</h3>\n      <ul>\n        <li>Competitive salary based on experience</li>\n        <li>Permanent full-time position</li>\n        <li>Dynamic work environment</li>\n        <li>Opportunity to work on diverse and stimulating events</li>\n      </ul>\n    ",
    "salary": "Based on experience",
    "startDate": "As soon as possible",
    "emailSubject": "Application - Event Coordinator DOCK619",
    "applyEmail": "rh@gpcqm.ca",
    "deadline": "2025-08-15",
    "datePosted": "2025-07-22"
  },
  {
    "id": 103,
    "title": "Dishwasher",
    "department": "Kitchen",
    "type": "Part-time",
    "location": "Montreal, QC",
    "summary": "Dishwasher position in our kitchen team.",
    "description": "\n      <p>We are looking for a reliable and hardworking dishwasher to join our dynamic kitchen team at our Montreal location.</p>\n      \n      <h3>Main Responsibilities</h3>\n      <ul>\n        <li>Wash dishes, glassware, flatware, pots and pans using dishwashers or by hand</li>\n        <li>Maintain cleanliness of kitchen areas</li>\n        <li>Assist with basic food preparation tasks as needed</li>\n        <li>Empty garbage containers regularly</li>\n        <li>Stock supplies such as food and utensils in serving stations and storage areas</li>\n        <li>Follow health and safety standards</li>\n      </ul>\n      \n      <h3>Requirements</h3>\n      <ul>\n        <li>Previous experience in a restaurant environment (an asset)</li>\n        <li>Ability to work in a fast-paced environment</li>\n        <li>Good physical condition (standing for long periods, lifting up to 50 lbs)</li>\n        <li>Flexibility to work evenings and weekends</li>\n        <li>Team spirit and positive attitude</li>\n      </ul>\n      \n      <h3>We Offer</h3>\n      <ul>\n        <li>Competitive hourly wage: $23/hour</li>\n        <li>Flexible schedule</li>\n        <li>Meal allowance</li>\n        <li>Pleasant work environment</li>\n        <li>Possibility of advancement within the company</li>\n      </ul>\n    ",
    "salary": "$23/hour",
    "startDate": "As soon as possible",
    "emailSubject": "Application - Dishwasher",
    "applyEmail": "rh@gpcqm.ca",
    "deadline": "2025-08-01",
    "datePosted": "2025-07-22"
  }
]